import matplotlib.pyplot as plt
import networkx as nx

G = nx.Graph()  # создаём объект графа

# определяем список узлов (ID узлов)
nodes = [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12]

# определяем список рёбер
# список кортежей, каждый из которых представляет ребро
# кортеж (id_1, id_2) означает, что узлы id_1 и id_2 соединены ребром
edges = [(1,2), (1,4), (2,3), (2,5), (4,5), (4,9), (5,6), (5,7), (5,8), (6,7), (7, 8), (7, 11), (9, 10), (10, 11), (11,12)]
# добавляем информацию в объект графа
G.add_nodes_from(nodes)
G.add_edges_from(edges)
pos = nx.circular_layout(G)
nx.draw(G, pos, with_labels = True)
nx.draw_networkx_edge_labels(G, 
	 pos,
    edge_labels={ (1,2):'17', (1,4):'39', (2,3):'1', (2,5):'16', (4,5):'42', (4,9):'2', (5,6):'26', (5,7):'13', (5,8):'11', (6,7):'50', (7, 8):'22', (7, 11):'22', (9, 10):'9', (10, 11):'22', (11,12):'27'
,
    },
    font_color='red'
)

plt.show()